/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Any]@ of the following are true";
"%[All]@ of the following are true" = "%1$[All]@ of the following are true";
"%[None]@ of the following are true" = "%1$[None]@ of the following are true";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Kind]@ is %2$[Any]@";
"%[Kind]@ is %[applications]@" = "%1$[Kind]@ is %2$[Application]@";
"%[Kind]@ is %[documents]@" = "%1$[Kind]@ is %2$[Document]@";
"%[Kind]@ is %[folders]@" = "%1$[Kind]@ is %2$[Folder]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Kind]@ is %2$[Image]@ %3$[All]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Kind]@ is %2$[Image]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Kind]@ is %2$[Image]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Kind]@ is %2$[Image]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Kind]@ is %2$[Image]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Kind]@ is %2$[Image]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Kind]@ is %2$[Music]@ %3$[All]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Kind]@ is %2$[Music]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Kind]@ is %2$[Music]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Kind]@ is %2$[Music]@ %3$[Purchased]@";
"%[Kind]@ is %[PDF]@" = "%1$[Kind]@ is %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Kind]@ is %2$[Presentation]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Kind]@ is %2$[Text]@ %3$[All]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Kind]@ is %2$[Text]@ %3$[Plain Text]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Kind]@ is %2$[Text]@ %3$[Rich Text]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Kind]@ is %2$[Text]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Kind]@ is %2$[Text]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Kind]@ is %2$[Text]@ %3$[Source Code]@";
"%[Kind]@ is %[movies]@" = "%1$[Kind]@ is %2$[Movie]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Kind]@ is %2$[Other]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ is %2$[within last]@ %3$@ %4$[days]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ is %2$[within last]@ %3$@ %4$[weeks]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ is %2$[within last]@ %3$@ %4$[months]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ is %2$[within last]@ %3$@ %4$[years]@";
"%@ is %[exactly]@ %@" = "%1$@ is %2$[exactly]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ is %2$[before]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ is %2$[after]@ %3$@";
"%@ is %[today]@" = "%1$@ is %2$[today]@";
"%@ is %[yesterday]@" = "%1$@ is %2$[yesterday]@";
"%@ is %[this week]@" = "%1$@ is %2$[this week]@";
"%@ is %[this month]@" = "%1$@ is %2$[this month]@";
"%@ is %[this year]@" = "%1$@ is %2$[this year]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[contains]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[begins with]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[ends with]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[is]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[matches]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[Any]@";
"%@ %[yes]@" = "%1$@ %2$[Yes]@";
"%@ %[no]@" = "%1$@ %2$[No]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[File visibility]@ %2$[Visible Items]@";
"%[File invisible]@ %[invisible items]@" = "%1$[File visibility]@ %2$[Invisible Items]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[File visibility]@ %2$[Visible or Invisible]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Raw Query]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[File extension]@ %2$[is]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[equals]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[is greater than]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[is less than]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[is not]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ contains %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[equals]@ %3$@ %4$[KB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[equals]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[equals]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[is less than]@ %3$@ %4$[KB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[is less than]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[is less than]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[is greater than]@ %3$@ %4$[KB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[is greater than]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[is greater than]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[is not]@ %3$@ %4$[KB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[is not]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[is not]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[equals]@ %3$@ hours %4$@ minutes %5$@ seconds";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[is less than]@ %3$@ hours %4$@ minutes %5$@ seconds";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[is greater than]@ %3$@ hours %4$@ minutes %5$@ seconds";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[is not]@ %3$@ hours %4$@ minutes %5$@ seconds";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[Items matching text]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[System files]@ %2$[are included]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[System files]@ %2$[aren’t included]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Spotlight items]@ %2$[are included]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Spotlight items]@ %2$[aren’t included]@";

